spliced-components/src/Spliced/Component/Fedex/wsdl/AddressValidationRequest.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/addressvalidation/v2">
<SOAP-ENV:Body>
<AddressValidationRequest>
<WebAuthenticationDetail>
<UserCredential>
<Key>Key</Key>
<Password>Password</Password>
</UserCredential>
</WebAuthenticationDetail>
<ClientDetail>
<AccountNumber>Account</AccountNumber>
<MeterNumber>Meter</MeterNumber>
</ClientDetail>
<TransactionDetail>
<CustomerTransactionId>WSVC_addressvalidation</CustomerTransactionId>
</TransactionDetail>
<Version>
<ServiceId>aval</ServiceId>
<Major>2</Major>
<Intermediate>0</Intermediate>
<Minor>0</Minor>
</Version>
<RequestTimestamp>2009-07-28T09:30:47-05:00</RequestTimestamp>
<Options>
<VerifyAddresses>1</VerifyAddresses>
<CheckResidentialStatus>1</CheckResidentialStatus>
<MaximumNumberOfMatches>10</MaximumNumberOfMatches>
<StreetAccuracy>EXACT</StreetAccuracy>
<DirectionalAccuracy>EXACT</DirectionalAccuracy>
<CompanyNameAccuracy>EXACT</CompanyNameAccuracy>
<ConvertToUpperCase>1</ConvertToUpperCase>
<RecognizeAlternateCityNames>1</RecognizeAlternateCityNames>
<ReturnParsedElements>1</ReturnParsedElements>
</Options>
<AddressesToValidate>
<AddressId>String</AddressId>
<CompanyName>String</CompanyName>
<Address>
<StreetLines>475 PARK AVE S FL 11</StreetLines>
<City>NEWYORK</City>
<StateOrProvinceCode>NY</StateOrProvinceCode>
<PostalCode>10016</PostalCode>
<UrbanizationCode>String</UrbanizationCode>
<CountryCode>US</CountryCode>
<Residential>1</Residential>
</Address>
</AddressesToValidate>
</AddressValidationRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>